# Terraform environment prod
#### Format and Style 🖌`success`
#### Initialization ⚙️`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Maybe further truncated see logs for complete plan output]
Acquiring state lock. This may take a few moments...
data.azuread_client_config.current: Reading...
data.azuread_application_published_app_ids.well_known: Reading...
data.azuread_client_config.current: Read complete after 0s [id=cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c-c217a3ea-402f-4886-ace5-478db72ab4c9-cc75a1cc-d6a1-4530-828f-86832ce91b9b]
data.azuread_application_published_app_ids.well_known: Read complete after 0s [id=appIds]
data.azuread_service_principal.msgraph: Reading...
data.azuread_directory_object.current: Reading...
data.azuread_directory_object.current: Read complete after 1s [id=cc75a1cc-d6a1-4530-828f-86832ce91b9b]
data.azuread_service_principal.msgraph: Read complete after 1s [id=b9d7b3d8-a063-4e34-89d9-15db56e22d42]
data.azuread_service_principal.current[0]: Reading...
data.azuread_service_principal.current[0]: Read complete after 0s [id=cc75a1cc-d6a1-4530-828f-86832ce91b9b]
data.azurerm_role_definition.contributor: Reading...
data.azurerm_resource_group.tfstate: Reading...
data.azurerm_subscription.current: Reading...
data.azurerm_role_definition.storage_blob_data_owner: Reading...
data.azurerm_role_definition.reader: Reading...
data.azurerm_role_definition.user_access_administrator: Reading...
data.azurerm_role_definition.contributor: Read complete after 1s [id=/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c]
data.azurerm_subscription.current: Read complete after 0s [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2]
data.azurerm_role_definition.storage_blob_data_owner: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b]
data.azurerm_role_definition.reader: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/acdd72a7-3385-48ef-bd42-f606fba81ae7]
data.azurerm_role_definition.user_access_administrator: Read complete after 0s [id=/providers/Microsoft.Authorization/roleDefinitions/18d7d88d-d35e-4fb5-a5c3-7773c20a72d9]
data.azurerm_resource_group.tfstate: Read complete after 1s [id=/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azuread_application.administrator will be updated in-place
  ~ resource "azuread_application" "administrator" {
        id                             = "/applications/005b1c70-6fa7-4205-9fa1-8b7a53713238"
        tags                           = []
        # (16 unchanged attributes hidden)

      - required_resource_access {
          - resource_app_id = "00000003-0000-0000-c000-000000000000" -> null

          - resource_access {
              - id   = "62a82d76-70ea-41e2-9197-370581804d09" -> null
              - type = "Role" -> null
            }
          - resource_access {
              - id   = "1bfefb4e-e0b5-418b-a88f-73c46d2cc8e9" -> null
              - type = "Role" -> null
            }
        }

        # (6 unchanged blocks hidden)
    }

  # azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-access-management-dev"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_branch" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "cea3fcdf-6a4a-49aa-9898-052c74cc65dd" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.branch.main" -> "github.Altinn.altinn-access-management.branch.main" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/cea3fcdf-6a4a-49aa-9898-052c74cc65dd" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:ref:refs/heads/main" -> "repo:Altinn/altinn-access-management:ref:refs/heads/main"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-access-management-prod"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_branch" {
      ~ application_object_id = "4723b56d-ccf2-47a9-88c1-dfacde1b8d91" -> (known after apply)
      ~ credential_id         = "374c5239-183b-44ad-8313-981cb8e5a990" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.branch.main" -> "github.Altinn.altinn-access-management.branch.main" # forces replacement
      ~ id                    = "4723b56d-ccf2-47a9-88c1-dfacde1b8d91/federatedIdentityCredential/374c5239-183b-44ad-8313-981cb8e5a990" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:ref:refs/heads/main" -> "repo:Altinn/altinn-access-management:ref:refs/heads/main"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-authorization-dev"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_branch" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "4a1ef995-8829-4ef0-8462-813e9b73b3a8" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.branch.main" -> "github.Altinn.altinn-authorization.branch.main" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/4a1ef995-8829-4ef0-8462-813e9b73b3a8" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:ref:refs/heads/main" -> "repo:Altinn/altinn-authorization:ref:refs/heads/main"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-authorization-prod"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_branch" {
      ~ application_object_id = "47569b89-a6f4-48f7-a47a-a236cdbf5319" -> (known after apply)
      ~ credential_id         = "563af092-44da-4c6a-bb1c-f3c8093e1767" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.branch.main" -> "github.Altinn.altinn-authorization.branch.main" # forces replacement
      ~ id                    = "47569b89-a6f4-48f7-a47a-a236cdbf5319/federatedIdentityCredential/563af092-44da-4c6a-bb1c-f3c8093e1767" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:ref:refs/heads/main" -> "repo:Altinn/altinn-authorization:ref:refs/heads/main"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-authorization-tmp-dev"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_branch" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "dc432350-e2b4-455c-8d52-6e0c6652b1f9" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.branch.main" -> "github.Altinn.altinn-authorization-tmp.branch.main" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/dc432350-e2b4-455c-8d52-6e0c6652b1f9" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:ref:refs/heads/main" -> "repo:Altinn/altinn-authorization-tmp:ref:refs/heads/main"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_branch["paa-altinn-altinn-authorization-tmp-prod"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_branch" {
      ~ application_object_id = "b79547d4-fe28-4f05-8b74-22ea0385054d" -> (known after apply)
      ~ credential_id         = "e48d9844-a3ce-426b-a423-a227f0afd6f8" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of branch 'main' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.branch.main" -> "github.Altinn.altinn-authorization-tmp.branch.main" # forces replacement
      ~ id                    = "b79547d4-fe28-4f05-8b74-22ea0385054d/federatedIdentityCredential/e48d9844-a3ce-426b-a423-a227f0afd6f8" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:ref:refs/heads/main" -> "repo:Altinn/altinn-authorization-tmp:ref:refs/heads/main"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at21"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "8885e560-6203-405f-9e16-649e04b8f671" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.at21" -> "github.Altinn.altinn-access-management.environment.at21" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/8885e560-6203-405f-9e16-649e04b8f671" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:at21" -> "repo:Altinn/altinn-access-management:environment:at21"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at22"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "19427452-8180-455a-a136-839b3c71a904" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.at22" -> "github.Altinn.altinn-access-management.environment.at22" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/19427452-8180-455a-a136-839b3c71a904" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:at22" -> "repo:Altinn/altinn-access-management:environment:at22"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at23"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "17be0834-cdbc-4554-baa9-e332aa7f86ef" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.at23" -> "github.Altinn.altinn-access-management.environment.at23" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/17be0834-cdbc-4554-baa9-e332aa7f86ef" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:at23" -> "repo:Altinn/altinn-access-management:environment:at23"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at24"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "e74301c9-5c8f-48ad-86d8-9050073e2938" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.at24" -> "github.Altinn.altinn-access-management.environment.at24" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/e74301c9-5c8f-48ad-86d8-9050073e2938" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:at24" -> "repo:Altinn/altinn-access-management:environment:at24"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-at25"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "f42e72f1-8742-462c-a4e0-361420e9dbf2" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.at25" -> "github.Altinn.altinn-access-management.environment.at25" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/f42e72f1-8742-462c-a4e0-361420e9dbf2" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:at25" -> "repo:Altinn/altinn-access-management:environment:at25"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-dev"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "68772c40-acfd-43d4-9ab8-9ebedcc8f76a" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.dev" -> "github.Altinn.altinn-access-management.environment.dev" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/68772c40-acfd-43d4-9ab8-9ebedcc8f76a" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:dev" -> "repo:Altinn/altinn-access-management:environment:dev"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-test"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "65a743fe-3c98-41d2-89a6-f13c29ed1aac" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.test" -> "github.Altinn.altinn-access-management.environment.test" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/65a743fe-3c98-41d2-89a6-f13c29ed1aac" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:test" -> "repo:Altinn/altinn-access-management:environment:test"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-dev-yt01"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "ffc7d734-7f12-4e59-b557-3e328fba3726" -> (known after apply)
      ~ credential_id         = "a34f832d-caaa-45f0-bff9-1f974aae3282" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.yt01" -> "github.Altinn.altinn-access-management.environment.yt01" # forces replacement
      ~ id                    = "ffc7d734-7f12-4e59-b557-3e328fba3726/federatedIdentityCredential/a34f832d-caaa-45f0-bff9-1f974aae3282" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:yt01" -> "repo:Altinn/altinn-access-management:environment:yt01"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-prod-prod"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "4723b56d-ccf2-47a9-88c1-dfacde1b8d91" -> (known after apply)
      ~ credential_id         = "e71b5faf-8fb5-43a3-a3a1-593f1d726bc9" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.prod" -> "github.Altinn.altinn-access-management.environment.prod" # forces replacement
      ~ id                    = "4723b56d-ccf2-47a9-88c1-dfacde1b8d91/federatedIdentityCredential/e71b5faf-8fb5-43a3-a3a1-593f1d726bc9" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:prod" -> "repo:Altinn/altinn-access-management:environment:prod"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-prod-staging"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "4723b56d-ccf2-47a9-88c1-dfacde1b8d91" -> (known after apply)
      ~ credential_id         = "087a42d2-c2a1-4797-bf14-4a7f7b428c74" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.staging" -> "github.Altinn.altinn-access-management.environment.staging" # forces replacement
      ~ id                    = "4723b56d-ccf2-47a9-88c1-dfacde1b8d91/federatedIdentityCredential/087a42d2-c2a1-4797-bf14-4a7f7b428c74" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:staging" -> "repo:Altinn/altinn-access-management:environment:staging"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-access-management-prod-tt02"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "4723b56d-ccf2-47a9-88c1-dfacde1b8d91" -> (known after apply)
      ~ credential_id         = "e21c2a97-8c6d-4230-8376-4dec5cfb04ab" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/altinn/altinn-access-management to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/Altinn/altinn-access-management to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-access-management.environment.tt02" -> "github.Altinn.altinn-access-management.environment.tt02" # forces replacement
      ~ id                    = "4723b56d-ccf2-47a9-88c1-dfacde1b8d91/federatedIdentityCredential/e21c2a97-8c6d-4230-8376-4dec5cfb04ab" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-access-management:environment:tt02" -> "repo:Altinn/altinn-access-management:environment:tt02"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at21"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "aac10cd9-4c24-4b26-8fca-73c39bb89eae" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.at21" -> "github.Altinn.altinn-authorization.environment.at21" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/aac10cd9-4c24-4b26-8fca-73c39bb89eae" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:at21" -> "repo:Altinn/altinn-authorization:environment:at21"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at22"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "eae19bf9-c102-415c-84a0-2e6c559e59be" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.at22" -> "github.Altinn.altinn-authorization.environment.at22" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/eae19bf9-c102-415c-84a0-2e6c559e59be" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:at22" -> "repo:Altinn/altinn-authorization:environment:at22"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at23"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "b4a0c06a-5955-4ac8-bdf5-6ec43eca18b5" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.at23" -> "github.Altinn.altinn-authorization.environment.at23" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/b4a0c06a-5955-4ac8-bdf5-6ec43eca18b5" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:at23" -> "repo:Altinn/altinn-authorization:environment:at23"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at24"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "1e25bc03-d23c-4415-a17e-f5d351a9a45f" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.at24" -> "github.Altinn.altinn-authorization.environment.at24" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/1e25bc03-d23c-4415-a17e-f5d351a9a45f" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:at24" -> "repo:Altinn/altinn-authorization:environment:at24"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-at25"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "6539a5d0-42fe-4b59-baf8-2bf92d33ce1e" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.at25" -> "github.Altinn.altinn-authorization.environment.at25" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/6539a5d0-42fe-4b59-baf8-2bf92d33ce1e" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:at25" -> "repo:Altinn/altinn-authorization:environment:at25"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-dev"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "c925c5c7-e1de-449b-b973-21d6ac21d9f9" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.dev" -> "github.Altinn.altinn-authorization.environment.dev" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/c925c5c7-e1de-449b-b973-21d6ac21d9f9" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:dev" -> "repo:Altinn/altinn-authorization:environment:dev"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-test"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "5723700e-a6e2-41a4-b0dd-eda4e7fb4761" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.test" -> "github.Altinn.altinn-authorization.environment.test" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/5723700e-a6e2-41a4-b0dd-eda4e7fb4761" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:test" -> "repo:Altinn/altinn-authorization:environment:test"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-dev-yt01"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160" -> (known after apply)
      ~ credential_id         = "fab4e22d-33df-4bc6-ae6a-138656183f4a" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.yt01" -> "github.Altinn.altinn-authorization.environment.yt01" # forces replacement
      ~ id                    = "b177be4c-4798-4ba7-9b42-bf1ff9cfb160/federatedIdentityCredential/fab4e22d-33df-4bc6-ae6a-138656183f4a" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:yt01" -> "repo:Altinn/altinn-authorization:environment:yt01"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-prod-prod"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "47569b89-a6f4-48f7-a47a-a236cdbf5319" -> (known after apply)
      ~ credential_id         = "102547a4-741e-4404-8d2c-aed50476d441" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.prod" -> "github.Altinn.altinn-authorization.environment.prod" # forces replacement
      ~ id                    = "47569b89-a6f4-48f7-a47a-a236cdbf5319/federatedIdentityCredential/102547a4-741e-4404-8d2c-aed50476d441" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:prod" -> "repo:Altinn/altinn-authorization:environment:prod"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-prod-staging"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "47569b89-a6f4-48f7-a47a-a236cdbf5319" -> (known after apply)
      ~ credential_id         = "65d79a35-f3ef-45e4-9212-f85867645323" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.staging" -> "github.Altinn.altinn-authorization.environment.staging" # forces replacement
      ~ id                    = "47569b89-a6f4-48f7-a47a-a236cdbf5319/federatedIdentityCredential/65d79a35-f3ef-45e4-9212-f85867645323" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:staging" -> "repo:Altinn/altinn-authorization:environment:staging"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-prod-tt02"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "47569b89-a6f4-48f7-a47a-a236cdbf5319" -> (known after apply)
      ~ credential_id         = "7730379c-513c-4b26-b6e1-b93c9a09b178" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/altinn/altinn-authorization to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/Altinn/altinn-authorization to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization.environment.tt02" -> "github.Altinn.altinn-authorization.environment.tt02" # forces replacement
      ~ id                    = "47569b89-a6f4-48f7-a47a-a236cdbf5319/federatedIdentityCredential/7730379c-513c-4b26-b6e1-b93c9a09b178" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization:environment:tt02" -> "repo:Altinn/altinn-authorization:environment:tt02"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-dev-at21"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "9567e9dc-4316-4130-a422-2ca29d72f38c" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at21' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.at21" -> "github.Altinn.altinn-authorization-tmp.environment.at21" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/9567e9dc-4316-4130-a422-2ca29d72f38c" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:at21" -> "repo:Altinn/altinn-authorization-tmp:environment:at21"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-dev-at22"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "87d1a026-5122-474b-80bc-e71a9de29e48" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at22' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.at22" -> "github.Altinn.altinn-authorization-tmp.environment.at22" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/87d1a026-5122-474b-80bc-e71a9de29e48" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:at22" -> "repo:Altinn/altinn-authorization-tmp:environment:at22"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-dev-at23"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "42053453-ca2a-46ca-85d9-19bb8b33ee31" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at23' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.at23" -> "github.Altinn.altinn-authorization-tmp.environment.at23" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/42053453-ca2a-46ca-85d9-19bb8b33ee31" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:at23" -> "repo:Altinn/altinn-authorization-tmp:environment:at23"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-dev-at24"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "055b5efd-678b-4fc5-b0b3-2e9d80d5024f" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at24' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.at24" -> "github.Altinn.altinn-authorization-tmp.environment.at24" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/055b5efd-678b-4fc5-b0b3-2e9d80d5024f" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:at24" -> "repo:Altinn/altinn-authorization-tmp:environment:at24"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-dev-at25"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "775fba42-d549-4f83-9b8a-ceb9ffcf9206" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'at25' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.at25" -> "github.Altinn.altinn-authorization-tmp.environment.at25" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/775fba42-d549-4f83-9b8a-ceb9ffcf9206" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:at25" -> "repo:Altinn/altinn-authorization-tmp:environment:at25"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-dev-dev"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "66ac26a6-f030-4c1c-a2ff-ef993c1952f2" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'dev' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.dev" -> "github.Altinn.altinn-authorization-tmp.environment.dev" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/66ac26a6-f030-4c1c-a2ff-ef993c1952f2" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:dev" -> "repo:Altinn/altinn-authorization-tmp:environment:dev"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-dev-test"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "8c343455-59c7-4df7-9eab-36f67952ad2d" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'test' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.test" -> "github.Altinn.altinn-authorization-tmp.environment.test" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/8c343455-59c7-4df7-9eab-36f67952ad2d" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:test" -> "repo:Altinn/altinn-authorization-tmp:environment:test"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-dev-yt01"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f" -> (known after apply)
      ~ credential_id         = "c55c2e48-da4c-46f3-b830-6675d2a9ca2c" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'yt01' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.yt01" -> "github.Altinn.altinn-authorization-tmp.environment.yt01" # forces replacement
      ~ id                    = "f0f8f56c-1785-40dd-ac2c-d1bde1a90b9f/federatedIdentityCredential/c55c2e48-da4c-46f3-b830-6675d2a9ca2c" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:yt01" -> "repo:Altinn/altinn-authorization-tmp:environment:yt01"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-prod-prod"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b79547d4-fe28-4f05-8b74-22ea0385054d" -> (known after apply)
      ~ credential_id         = "b7084382-8ed7-4ac7-af4e-9f8a47855426" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'prod' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.prod" -> "github.Altinn.altinn-authorization-tmp.environment.prod" # forces replacement
      ~ id                    = "b79547d4-fe28-4f05-8b74-22ea0385054d/federatedIdentityCredential/b7084382-8ed7-4ac7-af4e-9f8a47855426" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:prod" -> "repo:Altinn/altinn-authorization-tmp:environment:prod"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-prod-staging"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b79547d4-fe28-4f05-8b74-22ea0385054d" -> (known after apply)
      ~ credential_id         = "aea0cf34-8280-41ac-a5cd-d8a248e00ac7" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'staging' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.staging" -> "github.Altinn.altinn-authorization-tmp.environment.staging" # forces replacement
      ~ id                    = "b79547d4-fe28-4f05-8b74-22ea0385054d/federatedIdentityCredential/aea0cf34-8280-41ac-a5cd-d8a248e00ac7" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:staging" -> "repo:Altinn/altinn-authorization-tmp:environment:staging"
        # (3 unchanged attributes hidden)
    }

  # azuread_application_federated_identity_credential.oidc_environments["paa-altinn-altinn-authorization-tmp-prod-tt02"] must be replaced
-/+ resource "azuread_application_federated_identity_credential" "oidc_environments" {
      ~ application_object_id = "b79547d4-fe28-4f05-8b74-22ea0385054d" -> (known after apply)
      ~ credential_id         = "21f62068-fc16-4fe9-87df-5cf7c18f3030" -> (known after apply)
      ~ description           = "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/altinn/altinn-authorization-tmp to have access to the app registration" -> "Allow GitHub actions run within the context of environment 'tt02' from the repository https://github.com/Altinn/altinn-authorization-tmp to have access to the app registration"
      ~ display_name          = "github.altinn.altinn-authorization-tmp.environment.tt02" -> "github.Altinn.altinn-authorization-tmp.environment.tt02" # forces replacement
      ~ id                    = "b79547d4-fe28-4f05-8b74-22ea0385054d/federatedIdentityCredential/21f62068-fc16-4fe9-87df-5cf7c18f3030" -> (known after apply)
      ~ subject               = "repo:altinn/altinn-authorization-tmp:environment:tt02" -> "repo:Altinn/altinn-authorization-tmp:environment:tt02"
        # (3 unchanged attributes hidden)
    }

  # azurerm_app_configuration.state will be updated in-place
  ~ resource "azurerm_app_configuration" "state" {
        id                         = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.AppConfiguration/configurationStores/altinnterraformappconf02"
        name                       = "altinnterraformappconf02"
      ~ tags                       = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "10-09-2024 11:55:31 UTC"
          - "modifiedBy" = "GitHub: altinn/altinn-platform - Admin"
          - "repository" = "github.com/altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # azurerm_storage_account.backend will be updated in-place
  ~ resource "azurerm_storage_account" "backend" {
        id                                = "/subscriptions/d43d5057-8389-40d5-88c4-04db9275cbf2/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/altinnterraformstorage02"
        name                              = "altinnterraformstorage02"
      ~ tags                              = {
          - "costcenter" = "altinn3"
          - "createdAt"  = "09-07-2024 09:55:43 UTC"
          - "createdBy"  = "Bengt Rino Fredh"
          - "modifiedAt" = "10-09-2024 11:55:31 UTC"
          - "modifiedBy" = "GitHub: altinn/altinn-platform - Admin"
          - "repository" = "github.com/altinn/altinn-platform"
          - "solution"   = "platform"
        } -> (known after apply)
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 39 to add, 3 to change, 39 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @tjololo |
| Action | `push` |
| Working Directory | `./infrastructure/products` |
| State File | `github.com/altinn/altinn-platform/environments/prod/products.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_prod_products.tfstate.tfplan`